uhnp/src/InformationRegisters/ДатыЗапретаИзменения/ДатыЗапретаИзменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыЗапретаИзменения</name>
  <resources>
    <name>ДатаЗапрета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеДатыЗапрета</name>
    <comment>Описание относительной даты запрета, используемое для вычисления даты запрета на текущую дату</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий к отдельной настройке запрета по пользователю/группу пользователей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.РазделыДатЗапретаИзменения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>DefinedType.АдресатЗапретаИзменения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьПоEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНапоминания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомпактныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезСистемуВзаимодействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ДатыЗапретаИзменения/Forms/тн_ИзменитьДатыЗапретаПоОрганизации/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Заголовок = Заголовок + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Представление");
	ТекущиеДатыЗапрета = ТекущиеДатыЗапретаПоОрганизации(Организация);
	ЗначениеВРеквизитФормы(ТекущиеДатыЗапрета, "Пользователи");
	ЗаполнитьНомераКартинокПользователейДатЗапрета(Пользователи);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователиИсключения 

&НаКлиенте
Процедура ПользователиИсключенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Пользователь");
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Объекты = ВыбранноеЗначение;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Булево") Тогда  
		Возврат;
	Иначе
		Объекты = Новый Массив;
		Объекты.Добавить(ВыбранноеЗначение);
	КонецЕсли;	
	
	СписокПользователей = СписокПользователей("Пользователи");
	
	Для Каждого Значение Из Объекты Цикл 
		
		Если СписокПользователей.Найти(Значение) <> Неопределено  Тогда
			Отбор.Пользователь = Значение;
			Если ПользователиИсключения.НайтиСтроки(Отбор).Количество() = 0 Тогда
				НовыйПользователь 				= ПользователиИсключения.Добавить();
				НовыйПользователь.Пользователь  = Отбор.Пользователь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьНомераКартинокПользователейДатЗапрета(ПользователиИсключения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ ЗначениеЗаполнено(НоваяДатаЗапрета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните новую дату запрета по организации!");
		Возврат;
	КонецЕсли; 
	
	СписокИзменяемыхПользователей = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		СписокПользователей("Пользователи"), 
		СписокПользователей("ПользователиИсключения"));
	Если СписокИзменяемыхПользователей.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбраны пользователи для изменения даты запрета!");
		Возврат;
	КонецЕсли;
	
	ЗаписатьНовуюДатуЗапрета(СписокИзменяемыхПользователей);
	Если ВозвращаемоеЗначение = Истина Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ДатыЗапретаИзменения"));
	КонецЕсли;
	Закрыть();		

КонецПроцедуры            

&НаКлиенте
Процедура ПодобратьПользователейИсключения(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыборГруппПользователей", Истина);	
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Ссылка", СписокПользователей("Пользователи"));
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элементы.ПользователиИсключения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНомераКартинокПользователейДатЗапрета(РеквизитФормы, ТекущаяСтрока = Неопределено)
	
	Строки = Новый Массив;
	Если ТекущаяСтрока = Неопределено Тогда
		Строки = РеквизитФормы;
	Иначе
		Строки.Добавить(РеквизитФормы.НайтиПоИдентификатору(ТекущаяСтрока));
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	Для Каждого Строка Из Строки Цикл
		СвойстваСтроки = Новый Структура("Пользователь, НомерКартинки");
		ЗаполнитьЗначенияСвойств(СвойстваСтроки, Строка);
		МассивСтрок.Добавить(СвойстваСтроки);
	КонецЦикла;
	
	ЗаполнитьНомераКартинокПользователейДатЗапретаНаСервере(МассивСтрок);
	
	Индекс = Строки.Количество()-1;
	Пока Индекс >= 0 Цикл
		ЗаполнитьЗначенияСвойств(Строки[Индекс], МассивСтрок[Индекс], "НомерКартинки");
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНомераКартинокПользователейДатЗапретаНаСервере(МассивСтрок)
	
	Пользователи.ЗаполнитьНомераКартинокПользователей(
			МассивСтрок, "Пользователь", "НомерКартинки");
	
КонецПроцедуры
		
&НаСервереБезКонтекста
Функция ТекущиеДатыЗапретаПоОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатыЗапретаИзменения.Пользователь КАК Пользователь,
		|	ДатыЗапретаИзменения.Раздел КАК Раздел,
		|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета
		|ПОМЕСТИТЬ ВТ_ВсеДаты
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
		|ГДЕ
		|	ДатыЗапретаИзменения.Объект = &Организация
		|	И НЕ(ДатыЗапретаИзменения.Раздел <> ДатыЗапретаИзменения.Объект
		|				И ТИПЗНАЧЕНИЯ(ДатыЗапретаИзменения.Объект) = ТИП(ПланВидовХарактеристик.РазделыДатЗапретаИзменения))
		|	И НЕ ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехИнформационныхБаз)
		|	И ДатыЗапретаИзменения.ДатаЗапрета < ДАТАВРЕМЯ(2999, 12, 31)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВсеДаты.Пользователь КАК Пользователь,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеДаты.ДатаЗапрета) КАК КоличествоРазличныхДат
		|ПОМЕСТИТЬ ВТ_КоличествоДатПоПользователям
		|ИЗ
		|	ВТ_ВсеДаты КАК ВТ_ВсеДаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ВсеДаты.Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КоличествоДатПоПользователям.Пользователь КАК Пользователь,
		|	ВЫБОР
		|		КОГДА ВТ_КоличествоДатПоПользователям.КоличествоРазличныхДат > 1
		|			ТОГДА ""Различные даты по разделам""
		|		ИНАЧЕ ВТ_ВсеДаты.ДатаЗапрета
		|	КОНЕЦ КАК ДатаЗапрета,
		|	0 КАК НомерКартинки
		|ИЗ
		|	ВТ_КоличествоДатПоПользователям КАК ВТ_КоличествоДатПоПользователям
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеДаты КАК ВТ_ВсеДаты
		|		ПО ВТ_КоличествоДатПоПользователям.Пользователь = ВТ_ВсеДаты.Пользователь
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КоличествоДатПоПользователям.Пользователь,
		|	ВЫБОР
		|		КОГДА ВТ_КоличествоДатПоПользователям.КоличествоРазличныхДат > 1
		|			ТОГДА ""Различные даты по разделам""
		|		ИНАЧЕ ВТ_ВсеДаты.ДатаЗапрета
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_КоличествоДатПоПользователям.Пользователь.Наименование";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	ДатыЗапрета = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ДатыЗапрета;
	
КонецФункции

&НаСервере
Функция СписокПользователей(ИмяРеквизита)
	
	ПользователиТЗ = РеквизитФормыВЗначение(ИмяРеквизита);
	Возврат ПользователиТЗ.ВыгрузитьКолонку("Пользователь");
	
КонецФункции

&НаСервере
Процедура ЗаписатьНовуюДатуЗапрета(СписокПользователей)
	
	ВозвращаемоеЗначение = Ложь;
	Для Каждого СтрокаСпискаПользователей Из СписокПользователей Цикл 
		
		НаборЗаписей = РегистрыСведений.ДатыЗапретаИзменения.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Пользователь.Установить(СтрокаСпискаПользователей);
		НаборЗаписей.Отбор.Объект.Установить(Организация);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ДатаЗапрета = НоваяДатаЗапрета;	
		КонецЦикла; 
		
		Попытка
			НаборЗаписей.Записать();
			ВозвращаемоеЗначение = Истина; //если хотя бы по 1 пользователю изменили даты, нужно обновить данные на связанных формах
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось изменить даты запрета по пользователю: " 
				+ СтрокаСпискаПользователей + " по причине: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
